{
  "collection" :
  {
    "version" : "1.0",
    "href" : "http://pathwaycommons.github.io/guide/reading_list/",

    "items" : [
      {
        "href" : "http://pathwaycommons.github.io/guide/reading_list/paxtools/",
        "data" : [
          {
            "author" : "Emek Demir",
            "title" : "The BioPAX community standard for pathway data sharing",
            "journal" : "Nature Biotechnology",
            "volume": "28",
            "issue": "9",
            "page-range": "935-942",
            "url": "http://www.nature.com/nbt/journal/v28/n9/full/nbt.1666.html",
            "date" : "2010-09-09",
            "abstract": "Biological Pathway Exchange (BioPAX) is a standard language to represent biological pathways at the molecular and cellular level and to facilitate the exchange of pathway data. The rapid growth of the volume of pathway data has spurred the development of databases and computational tools to aid interpretation; however, use of these data is hampered by the current fragmentation of pathway information across many databases with incompatible formats. BioPAX, which was created through a community process, solves this problem
            by making pathway data substantially easier to collect,
            index, interpret and share. BioPAX can represent metabolic and signaling pathways, molecular and genetic interactions and gene regulation networks. Using BioPAX, millions of interactions, organized into thousands of pathways, from many organisms are available from a growing number of databases. This large amount of pathway data in a computable form will support visualization, analysis and biological discovery.",
            "comment": "",
            "type": "Perspective"
          },

          {
            "author" : "Emek Demir",
            "title" : "Using Biological Pathway Data with Paxtools",
            "journal" : "PLoS computational biology",
            "volume": "9",
            "issue": "9",
            "page-range": "e1003194-5",
            "url": "http://dx.plos.org/10.1371/journal.pcbi.1003194",
            "date" : "2013-09-09",
            "abstract": "A rapidly growing corpus of formal, computable pathway information can be used to answer important biological questions including finding non-trivial connections between cellular processes, identifying significantly altered portions of the cellular network in a disease state and building predictive models that can be used for precision medicine. Due to its complexity and fragmented nature, however, working with pathway data is still difficult. We present Paxtools, a Java library that contains algorithms, software components and converters for biological pathways represented in the standard BioPAX language. Paxtools allows scientists to focus on their scientific problem by removing technical barriers to access and analyse pathway information. Paxtools can run on any platform that has a Java Runtime Environment and was tested on most modern operating systems. Paxtools is open source and is available under the Lesser GNU public license (LGPL), which allows users to freely use the code in their software systems with a requirement for attribution. Source code for the current release (4.2.0) can be found in Software S1. A detailed manual for obtaining and using Paxtools can be found in Protocol S1. The latest sources and release bundles can be obtained from biopax.org/paxtools.",
            "comment": "",
            "type": "Article"
          },

          {
            "author" : "Augustin Luna",
            "title" : "PaxtoolsR: pathway analysis in R using Pathway Commons",
            "journal" : "Bioinformatics",
            "volume": "32",
            "issue": "8",
            "page-range": "1262-1264",
            "url": "http://bioinformatics.oxfordjournals.org/content/32/8/1262.full?sid=b9f1914c-160d-41e0-9a36-f2c8a9d10767",
            "date" : "2016-04-15",
            "abstract": "PURPOSE:PaxtoolsR package enables access to pathway data represented in the BioPAX format and made available through the Pathway Commons webservice for users of the R language to aid in advanced pathway analyses. Features include the extraction, merging and validation of pathway data represented in the BioPAX format. This package also provides novel pathway datasets and advanced querying features for R users through the Pathway Commons webservice allowing users to query, extract and retrieve data and integrate these data with local BioPAX datasets.
            AVAILABILITY AND IMPLEMENTATION:The PaxtoolsR package is compatible with versions of R 3.1.1 (and higher) on Windows, Mac OS X and Linux using Bioconductor 3.0 and is available through the Bioconductor R package repository along with source code and a tutorial vignette describing common tasks, such as data visualization and gene set enrichment analysis. Source code and documentation are at http://www.bioconductor.org/packages/paxtoolsr. This plugin is free, open-source and licensed under the LGPL-3.
            CONTACT:paxtools@cbio.mskcc.org or lunaa@cbio.mskcc.org.",
            "comment": "",
            "type": "Application Note"
          }

        ]
      }
    ]

  }
}
