{
  "collection" :
  {
    "version" : "1.0",
    "href" : "http://pathwaycommons.github.io/guide/reading_list/",

    "items" : [
      {
        "href" : "http://pathwaycommons.github.io/guide/reading_list/standards/",
        "data" : [
          {
            "author" : "Emek Demir",
            "title" : "The BioPAX community standard for pathway data sharing",
            "journal" : "Nature Biotechnology",
            "volume": "28",
            "issue": "9",
            "page-range": "935-942",
            "url": "http://www.nature.com/nbt/journal/v28/n9/full/nbt.1666.html",
            "date" : "2010-09-09",
            "abstract": "Biological Pathway Exchange (BioPAX) is a standard language to represent biological pathways at the molecular and cellular level and to facilitate the exchange of pathway data. The rapid growth of the volume of pathway data has spurred the development of databases and computational tools to aid interpretation; however, use of these data is hampered by the current fragmentation of pathway information across many databases with incompatible formats. BioPAX, which was created through a community process, solves this problem
            by making pathway data substantially easier to collect,
            index, interpret and share. BioPAX can represent metabolic and signaling pathways, molecular and genetic interactions and gene regulation networks. Using BioPAX, millions of interactions, organized into thousands of pathways, from many organisms are available from a growing number of databases. This large amount of pathway data in a computable form will support visualization, analysis and biological discovery.",
            "comment": "",
            "type": "Perspective"
          },

          {
            "author" : "Nicolas Le Novère",
            "title" : "The Systems Biology Graphical Notation",
            "journal" : "Nature Biotechnology",
            "volume": "27",
            "issue": "8",
            "page-range": "735-741",
            "url": "http://www.nature.com/doifinder/10.1038/nbt.1558",
            "date" : "2009-08-07",
            "abstract": "Circuit diagrams and Unified Modeling Language diagrams are just two examples of standard visual languages that help accelerate work by promoting regularity, removing ambiguity and enabling software tool support for communication of complex information. Ironically, despite having one of the highest ratios of graphical to textual information, biology still lacks standard graphical notations. The recent deluge of biological knowledge makes addressing this deficit
            a pressing concern. Toward this goal, we present the Systems Biology Graphical Notation (SBGN), a visual language developed by a community of biochemists, modelers and computer scientists. SBGN consists of three complementary languages: process diagram,
            entity relationship diagram and activity flow diagram. Together they enable scientists to represent networks of biochemical interactions in a standard, unambiguous way. We believe that SBGN will foster efficient and accurate representation, visualization, storage, exchange and reuse of information on all kinds of biological knowledge, from gene regulation, to metabolism, to cellular signaling.",
            "comment": "",
            "type": "Perspective"
          },

          {
            "author" : "M. Hucka",
            "title" : "The systems biology markup language (SBML): a medium for representation and exchange of biochemical network models.",
            "journal" : "Bioinformatics",
            "volume": "19",
            "issue": "4",
            "page-range": "524-531",
            "url": "http://bioinformatics.oxfordjournals.org/content/19/4/524",
            "date" : "2003-03-01",
            "abstract": "MOTIVATION: Molecular biotechnology now makes it possible to build elaborate systems models, but the systems biology community needs information standards if models are to be shared, evaluated and developed cooperatively.
            RESULTS:We summarize the Systems Biology Markup Language (SBML) Level 1, a free, open, XML-based format for representing biochemical reaction networks. SBML is a software-independent language for describing models common to research in many areas of computational biology, including cell signaling pathways, metabolic pathways, gene regulation, and others.
            AVAILABILITY: The specification of SBML Level 1 is freely available from http://www.sbml.org/",
            "comment": "",
            "type": "Article"
          }

        ]
      }
    ]

  }
}
